[
    {
        "arabic": "الغوث الأعظم",
        "roman": "Al-Ghous Al-Azam",
        "english": "The Supreme Helper",
        "urdu": "غوث اعظم",
        "romanDesc": "Al-Ghous Al-Azam ka matlab hai wo jo ummat ke liye sab se bada madadgar hai, jaisa ke Qadri silsila mein zikr hai. Hazrat Abdul Qadir Jilani 'Futooh al-Ghaib' mein farmate hain, 'Jo Allah par tawakkul kare, usay madad zaroor milti hai.' Qadri silsila isay 100 bar baad az-Fajr padhne aur dua mangne ka mashwara deta hai.",
        "englishDesc": "Al-Ghous Al-Azam signifies the greatest helper of the ummah, as noted in the Qadri tradition. Shaykh Abdul Qadir Jilani in 'Futooh al-Ghaib' states, 'Whoever relies on Allah will surely receive aid.' The Qadri order suggests reciting it 100 times daily after Fajr, followed by supplication.",
        "urduDesc": "الغوث الأعظم کا مطلب ہے وہ جو امت کے لیے سب سے بڑا مددگار ہے، جیسا کہ قادری سلسلہ میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'فتوح الغیب' میں فرماتے ہیں، 'جو اللہ پر توکل کرے، اسے مدد ضرور ملتی ہے۔' قادری سلسلہ اسے روزانہ فجر کے بعد 100 بار پڑھنے اور دعا مانگنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "محي الدين",
        "roman": "Muhyiddin",
        "english": "The Reviver of Faith",
        "urdu": "دین کا احیا کرنے والا",
        "romanDesc": "Muhyiddin ka matlab hai wo jo deen ko zinda karta hai, jaisa ke unki taleemat mein zikr hai. Hazrat Abdul Qadir Jilani 'Ghunyat at-Talibin' mein farmate hain, 'Deen ki zindagi qalb ki zindagi hai.' Qadri silsila isay 70 bar baad az-Zuhr padhne ka mashwara deta hai.",
        "englishDesc": "Muhyiddin signifies the one who revives the faith, as noted in his teachings. Shaykh Abdul Qadir Jilani in 'Ghunyat at-Talibin' states, 'The life of faith is the life of the heart.' The Qadri order suggests reciting it 70 times daily after Zuhr.",
        "urduDesc": "محی الدین کا مطلب ہے وہ جو دین کو زندہ کرتا ہے، جیسا کہ ان کی تعلیمات میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'غنیۃ الطالبین' میں فرماتے ہیں، 'دین کی زندگی قلب کی زندگی ہے۔' قادری سلسلہ اسے روزانہ ظہر کے بعد 70 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "سلطان الأولياء",
        "roman": "Sultan al-Awliya",
        "english": "The King of Saints",
        "urdu": "اولیاء کا سلطان",
        "romanDesc": "Sultan al-Awliya ka matlab hai wo jo awliya ke sardar hain, jaisa ke Qadri riwayat mein zikr hai. Hazrat Data Ganj Bakhsh 'Kashf al-Mahjub' mein farmate hain, 'Ghous-e-Azam ka maqam wilayat ka taj hai.' Qadri silsila isay 80 bar baad az-Asr padhne ka mashwara deta hai.",
        "englishDesc": "Sultan al-Awliya signifies the leader of all saints, as noted in Qadri tradition. Data Ganj Bakhsh in 'Kashf al-Mahjub' states, 'The station of Ghous-e-Azam is the crown of sainthood.' The Qadri order suggests reciting it 80 times daily after Asr.",
        "urduDesc": "سلطان الأولیاء کا مطلب ہے وہ جو اولیاء کے سردار ہیں، جیسا کہ قادری روایت میں ذکر ہے۔ حضرت داتا گنج بخش 'کشف المحجوب' میں فرماتے ہیں، 'غوث اعظم کا مقام ولایت کا تاج ہے۔' قادری سلسلہ اسے روزانہ عصر کے بعد 80 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "قطب الأقطاب",
        "roman": "Qutb al-Aqtab",
        "english": "The Pole of Poles",
        "urdu": "اقطاب کا قطب",
        "romanDesc": "Qutb al-Aqtab ka matlab hai wo jo rohani dunya ka markaz hai, jaisa ke Qadri silsila mein zikr hai. Hazrat Abdul Qadir Jilani 'Sirr al-Asrar' mein farmate hain, 'Qutb wahi hai jo qalbon ko Allah ki taraf le jata hai.' Qadri silsila isay 90 bar baad az-Maghrib padhne ka mashwara deta hai.",
        "englishDesc": "Qutb al-Aqtab signifies the central pivot of the spiritual realm, as noted in Qadri tradition. Shaykh Abdul Qadir Jilani in 'Sirr al-Asrar' states, 'The Qutb is he who leads hearts to Allah.' The Qadri order suggests reciting it 90 times daily after Maghrib.",
        "urduDesc": "قطب الأقطاب کا مطلب ہے وہ جو روحانی دنیا کا مرکز ہے، جیسا کہ قادری سلسلہ میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'سر الاسرار' میں فرماتے ہیں، 'قطب وہی ہے جو قلبوں کو اللہ کی طرف لے جاتا ہے۔' قادری سلسلہ اسے روزانہ مغرب کے بعد 90 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "بزغ الأشرف",
        "roman": "Bazgh al-Ashraf",
        "english": "The Noble Falcon",
        "urdu": "شریف باز",
        "romanDesc": "Bazgh al-Ashraf ka matlab hai wo jo rohani bulandi ka shikari hai, jaisa ke unke karamat mein zikr hai. Hazrat Khwaja Moinuddin Chishti farmate hain, 'Ghous-e-Azam ka zikr qalb ko bulandi ki parwaz deta hai.' Qadri silsila isay 66 bar baad az-Fajr padhne ka mashwara deta hai.",
        "englishDesc": "Bazgh al-Ashraf signifies the noble falcon soaring in spiritual heights, as noted in his miracles. Khwaja Moinuddin Chishti states, 'The zikr of Ghous-e-Azam grants the heart the flight of elevation.' The Qadri order suggests reciting it 66 times daily after Fajr.",
        "urduDesc": "بزغ الأشرف کا مطلب ہے وہ جو روحانی بلندی کا شکاری ہے، جیسا کہ ان کے کرامات میں ذکر ہے۔ حضرت خواجہ معین الدین چشتی فرماتے ہیں، 'غوث اعظم کا ذکر قلب کو بلندی کی پرواز دیتا ہے۔' قادری سلسلہ اسے روزانہ فجر کے بعد 66 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "شيخ المشايخ",
        "roman": "Shaykh al-Mashayikh",
        "english": "The Master of Masters",
        "urdu": "مشائخ کا شیخ",
        "romanDesc": "Shaykh al-Mashayikh ka matlab hai wo jo sab shuyookh ka ustad hai, jaisa ke Qadri riwayat mein zikr hai. Hazrat Abdul Qadir Jilani 'Futooh al-Ghaib' mein farmate hain, 'Ustad wahi jo talib ko haq tak pohanchaye.' Qadri silsila isay 88 bar baad az-Zuhr padhne ka mashwara deta hai.",
        "englishDesc": "Shaykh al-Mashayikh signifies the master of all spiritual guides, as noted in Qadri tradition. Shaykh Abdul Qadir Jilani in 'Futooh al-Ghaib' states, 'The true master leads the seeker to truth.' The Qadri order suggests reciting it 88 times daily after Zuhr.",
        "urduDesc": "شیخ المشایخ کا مطلب ہے وہ جو سب شیوخ کا استاد ہے، جیسا کہ قادری روایت میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'فتوح الغیب' میں فرماتے ہیں، 'استاد وہی جو طالب کو حق تک پہنچائے۔' قادری سلسلہ اسے روزانہ ظہر کے بعد 88 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "الوارث المحمدي",
        "roman": "Al-Warith al-Muhammadi",
        "english": "The Inheritor of Muhammad",
        "urdu": "محمد کا وارث",
        "romanDesc": "Al-Warith al-Muhammadi ka matlab hai wo jo Nabi (SAW) ke rohani waris hain, jaisa ke unki taleemat mein zikr hai. Hazrat Bahauddin Naqshband farmate hain, 'Ghous-e-Azam ka maqam Rasool (SAW) ke noor ka aaina hai.' Qadri silsila isay 77 bar baad az-Asr padhne ka mashwara deta hai.",
        "englishDesc": "Al-Warith al-Muhammadi signifies the spiritual inheritor of the Prophet (PBUH), as noted in his teachings. Bahauddin Naqshband states, 'The station of Ghous-e-Azam is a mirror of the Prophet’s (PBUH) light.' The Qadri order suggests reciting it 77 times daily after Asr.",
        "urduDesc": "الوارث المحمدی کا مطلب ہے وہ جو نبی (صلی اللہ علیہ وسلم) کے روحانی وارث ہیں، جیسا کہ ان کی تعلیمات میں ذکر ہے۔ حضرت بہاؤالدین نقشبند فرماتے ہیں، 'غوث اعظم کا مقام رسول (صلی اللہ علیہ وسلم) کے نور کا آئینہ ہے۔' قادری سلسلہ اسے روزانہ عصر کے بعد 77 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "إمام المتقين",
        "roman": "Imam al-Muttaqin",
        "english": "The Leader of the Pious",
        "urdu": "متقیوں کا امام",
        "romanDesc": "Imam al-Muttaqin ka matlab hai wo jo parhezgaron ka rahbar hai, jaisa ke unki seerat mein zikr hai. Hazrat Abdul Qadir Jilani 'Ghunyat at-Talibin' mein farmate hain, 'Taqwa Allah ke qurb ka rasta hai.' Qadri silsila isay 66 bar baad az-Maghrib padhne ka mashwara deta hai.",
        "englishDesc": "Imam al-Muttaqin signifies the leader of the God-fearing, as noted in his biography. Shaykh Abdul Qadir Jilani in 'Ghunyat at-Talibin' states, 'Piety is the path to Allah’s nearness.' The Qadri order suggests reciting it 66 times daily after Maghrib.",
        "urduDesc": "امام المتقین کا مطلب ہے وہ جو پرہیزگاروں کا رہبر ہے، جیسا کہ ان کی سیرت میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'غنیۃ الطالبین' میں فرماتے ہیں، 'تقویٰ اللہ کے قرب کا راستہ ہے۔' قادری سلسلہ اسے روزانہ مغرب کے بعد 66 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "نور الله",
        "roman": "Nurullah",
        "english": "The Light of Allah",
        "urdu": "اللہ کا نور",
        "romanDesc": "Nurullah ka matlab hai wo jo Allah ke noor ka mazhar hai, jaisa ke unke karamat mein zikr hai. Hazrat Ibn Arabi 'Futus al-Hikam' mein farmate hain, 'Ghous-e-Azam ka noor qalbon ko roshan karta hai.' Qadri silsila isay 55 bar baad az-Fajr padhne ka mashwara deta hai.",
        "englishDesc": "Nurullah signifies the manifestation of Allah’s light, as noted in his miracles. Ibn Arabi in 'Fusus al-Hikam' states, 'The light of Ghous-e-Azam illuminates hearts.' The Qadri order suggests reciting it 55 times daily after Fajr.",
        "urduDesc": "نور اللہ کا مطلب ہے وہ جو اللہ کے نور کا مظہر ہے، جیسا کہ ان کے کرامات میں ذکر ہے۔ حضرت ابن عربی 'فیوض الحکم' میں فرماتے ہیں، 'غوث اعظم کا نور قلبوں کو روشن کرتا ہے۔' قادری سلسلہ اسے روزانہ فجر کے بعد 55 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "حامي الشريعة",
        "roman": "Hami ash-Shari’ah",
        "english": "The Protector of Shariah",
        "urdu": "شریعت کا محافظ",
        "romanDesc": "Hami ash-Shari’ah ka matlab hai wo jo shariat ka difa karta hai, jaisa ke unki taleemat mein zikr hai. Hazrat Abdul Qadir Jilani 'Futooh al-Ghaib' mein farmate hain, 'Shariat haq ka rasta hai.' Qadri silsila isay 88 bar baad az-Zuhr padhne ka mashwara deta hai.",
        "englishDesc": "Hami ash-Shari’ah signifies the defender of Islamic law, as noted in his teachings. Shaykh Abdul Qadir Jilani in 'Futooh al-Ghaib' states, 'Shariah is the path of truth.' The Qadri order suggests reciting it 88 times daily after Zuhr.",
        "urduDesc": "حامی الشریعہ کا مطلب ہے وہ جو شریعت کا دفاع کرتا ہے، جیسا کہ ان کی تعلیمات میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'فتوح الغیب' میں فرماتے ہیں، 'شریعت حق کا راستہ ہے۔' قادری سلسلہ اسے روزانہ ظہر کے بعد 88 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "مروج الطريقة",
        "roman": "Murawwij at-Tariqah",
        "english": "The Promoter of the Path",
        "urdu": "طریقت کا فروغ دینے والا",
        "romanDesc": "Murawwij at-Tariqah ka matlab hai wo jo tariqat ko phailata hai, jaisa ke Qadri silsila mein zikr hai. Hazrat Bahauddin Naqshband farmate hain, 'Ghous-e-Azam ka rasta qalb ko Allah tak le jata hai.' Qadri silsila isay 77 bar baad az-Asr padhne ka mashwara deta hai.",
        "englishDesc": "Murawwij at-Tariqah signifies the one who spreads the spiritual path, as noted in Qadri tradition. Bahauddin Naqshband states, 'The path of Ghous-e-Azam leads the heart to Allah.' The Qadri order suggests reciting it 77 times daily after Asr.",
        "urduDesc": "مروج الطریقہ کا مطلب ہے وہ جو طریقت کو پھیلاتا ہے، جیسا کہ قادری سلسلہ میں ذکر ہے۔ حضرت بہاؤالدین نقشبند فرماتے ہیں، 'غوث اعظم کا راستہ قلب کو اللہ تک لے جاتا ہے۔' قادری سلسلہ اسے روزانہ عصر کے بعد 77 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "حجة الله",
        "roman": "Hujjatullah",
        "english": "The Proof of Allah",
        "urdu": "اللہ کی دلیل",
        "romanDesc": "Hujjatullah ka matlab hai wo jo Allah ki daleel hai, jaisa ke unke karamat mein zikr hai. Hazrat Abdul Qadir Jilani 'Sirr al-Asrar' mein farmate hain, 'Haq ka wali Allah ki hujjat hai.' Qadri silsila isay 66 bar baad az-Maghrib padhne ka mashwara deta hai.",
        "englishDesc": "Hujjatullah signifies the one who is a proof of Allah, as noted in his miracles. Shaykh Abdul Qadir Jilani in 'Sirr al-Asrar' states, 'The friend of Allah is His proof.' The Qadri order suggests reciting it 66 times daily after Maghrib.",
        "urduDesc": "حجۃ اللہ کا مطلب ہے وہ جو اللہ کی دلیل ہے، جیسا کہ ان کے کرامات میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'سر الاسرار' میں فرماتے ہیں، 'حق کا ولی اللہ کی حجت ہے۔' قادری سلسلہ اسے روزانہ مغرب کے بعد 66 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "مظهر العجائب",
        "roman": "Mazhar al-Aja’ib",
        "english": "The Manifestation of Wonders",
        "urdu": "عجائبات کا مظہر",
        "romanDesc": "Mazhar al-Aja’ib ka matlab hai wo jo karamat ka zahir hai, jaisa ke Qadri riwayat mein zikr hai. Hazrat Ibn Arabi 'Futuhat al-Makkiyya' mein farmate hain, 'Ghous-e-Azam ke karamat Allah ki qudrat ke aainay hain.' Qadri silsila isay 55 bar baad az-Fajr padhne ka mashwara deta hai.",
        "englishDesc": "Mazhar al-Aja’ib signifies the one who manifests miracles, as noted in Qadri tradition. Ibn Arabi in 'Futuhat al-Makkiyya' states, 'The miracles of Ghous-e-Azam are mirrors of Allah’s power.' The Qadri order suggests reciting it 55 times daily after Fajr.",
        "urduDesc": "مظہر العجائب کا مطلب ہے وہ جو کرامات کا ظاہر ہے، جیسا کہ قادری روایت میں ذکر ہے۔ حضرت ابن عربی 'فتوحات مکیہ' میں فرماتے ہیں، 'غوث اعظم کے کرامات اللہ کی قدرت کے آئینے ہیں۔' قادری سلسلہ اسے روزانہ فجر کے بعد 55 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "قاضي الحاجات",
        "roman": "Qadi al-Hajat",
        "english": "The Fulfiller of Needs",
        "urdu": "حاجات پوری کرنے والا",
        "romanDesc": "Qadi al-Hajat ka matlab hai wo jo muridon ki zaroorat puri karta hai, jaisa ke unke karamat mein zikr hai. Hazrat Abdul Qadir Jilani 'Ghunyat at-Talibin' mein farmate hain, 'Allah se maango, wo kabhi naumeed nahi karta.' Qadri silsila isay 88 bar baad az-Zuhr padhne ka mashwara deta hai.",
        "englishDesc": "Qadi al-Hajat signifies the one who fulfills the needs of devotees, as noted in his miracles. Shaykh Abdul Qadir Jilani in 'Ghunyat at-Talibin' states, 'Ask from Allah, for He never disappoints.' The Qadri order suggests reciting it 88 times daily after Zuhr.",
        "urduDesc": "قاضی الحاجات کا مطلب ہے وہ جو مریدوں کی ضرورت پوری کرتا ہے، جیسا کہ ان کے کرامات میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'غنیۃ الطالبین' میں فرماتے ہیں، 'اللہ سے مانگو، وہ کبھی ناامید نہیں کرتا۔' قادری سلسلہ اسے روزانہ ظہر کے بعد 88 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "مؤسس القادرية",
        "roman": "Mu’assis al-Qadiriyya",
        "english": "The Founder of the Qadri Order",
        "urdu": "قادریہ کا بانی",
        "romanDesc": "Mu’assis al-Qadiriyya ka matlab hai wo jo Qadri silsila ka bani hai, jaisa ke tarikh mein zikr hai. Hazrat Bahauddin Naqshband farmate hain, 'Qadri tariqat haq aur muhabbat ka rasta hai.' Qadri silsila isay 77 bar baad az-Asr padhne ka mashwara deta hai.",
        "englishDesc": "Mu’assis al-Qadiriyya signifies the founder of the Qadri order, as noted in history. Bahauddin Naqshband states, 'The Qadri path is one of truth and love.' The Qadri order suggests reciting it 77 times daily after Asr.",
        "urduDesc": "مؤسس القادریہ کا مطلب ہے وہ جو قادری سلسلہ کا بانی ہے، جیسا کہ تاریخ میں ذکر ہے۔ حضرت بہاؤالدین نقشبند فرماتے ہیں، 'قادری طریقت حق اور محبت کا راستہ ہے۔' قادری سلسلہ اسے روزانہ عصر کے بعد 77 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "سيد المرسلين",
        "roman": "Sayyid al-Mursalin",
        "english": "The Chief of the Messengers’ Followers",
        "urdu": "مرسلین کا سردار",
        "romanDesc": "Sayyid al-Mursalin ka matlab hai wo jo Nabi (SAW) ke ummatiyon ka sardar hai, jaisa ke Qadri riwayat mein zikr hai. Hazrat Abdul Qadir Jilani 'Futooh al-Ghaib' mein farmate hain, 'Rasool (SAW) ke pairvi mein hi najat hai.' Qadri silsila isay 66 bar baad az-Maghrib padhne ka mashwara deta hai.",
        "englishDesc": "Sayyid al-Mursalin signifies the chief of the followers of the messengers, as noted in Qadri tradition. Shaykh Abdul Qadir Jilani in 'Futooh al-Ghaib' states, 'Salvation lies in following the Prophet (PBUH).' The Qadri order suggests reciting it 66 times daily after Maghrib.",
        "urduDesc": "سید المرسلین کا مطلب ہے وہ جو نبی (صلی اللہ علیہ وسلم) کے امتیوں کا سردار ہے، جیسا کہ قادری روایت میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'فتوح الغیب' میں فرماتے ہیں، 'رسول (صلی اللہ علیہ وسلم) کے پیروی میں ہی نجات ہے۔' قادری سلسلہ اسے روزانہ مغرب کے بعد 66 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "غياث المستغيثين",
        "roman": "Ghiyath al-Mustaghithin",
        "english": "The Helper of Those Seeking Aid",
        "urdu": "مدد مانگنے والوں کا غیاث",
        "romanDesc": "Ghiyath al-Mustaghithin ka matlab hai wo jo faryadion ki madad karta hai, jaisa ke unke karamat mein zikr hai. Hazrat Khwaja Moinuddin Chishti farmate hain, 'Ghous-e-Azam ki madad Allah ki rehmat ka wasila hai.' Qadri silsila isay 55 bar baad az-Fajr padhne ka mashwara deta hai.",
        "englishDesc": "Ghiyath al-Mustaghithin signifies the one who aids those who cry for help, as noted in his miracles. Khwaja Moinuddin Chishti states, 'The aid of Ghous-e-Azam is a means to Allah’s mercy.' The Qadri order suggests reciting it 55 times daily after Fajr.",
        "urduDesc": "غیاث المستغیثین کا مطلب ہے وہ جو فریادیوں کی مدد کرتا ہے، جیسا کہ ان کے کرامات میں ذکر ہے۔ حضرت خواجہ معین الدین چشتی فرماتے ہیں، 'غوث اعظم کی مدد اللہ کی رحمت کا وسیلہ ہے۔' قادری سلسلہ اسے روزانہ فجر کے بعد 55 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "أسد الله",
        "roman": "Asadullah",
        "english": "The Lion of Allah",
        "urdu": "اللہ کا شیر",
        "romanDesc": "Asadullah ka matlab hai wo jo Allah ke deen ke liye bahadur hai, jaisa ke unki seerat mein zikr hai. Hazrat Abdul Qadir Jilani 'Ghunyat at-Talibin' mein farmate hain, 'Shujaat haq ke liye jang hai.' Qadri silsila isay 88 bar baad az-Zuhr padhne ka mashwara deta hai.",
        "englishDesc": "Asadullah signifies the lion-hearted defender of Allah’s faith, as noted in his biography. Shaykh Abdul Qadir Jilani in 'Ghunyat at-Talibin' states, 'Courage is fighting for the truth.' The Qadri order suggests reciting it 88 times daily after Zuhr.",
        "urduDesc": "اسد اللہ کا مطلب ہے وہ جو اللہ کے دین کے لیے بہادر ہے، جیسا کہ ان کی سیرت میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'غنیۃ الطالبین' میں فرماتے ہیں، 'شجاعت حق کے لیے جنگ ہے۔' قادری سلسلہ اسے روزانہ ظہر کے بعد 88 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "مرشد الكامل",
        "roman": "Murshid al-Kamil",
        "english": "The Perfect Guide",
        "urdu": "کامل مرشد",
        "romanDesc": "Murshid al-Kamil ka matlab hai wo jo mukammal rohani rahnumai karta hai, jaisa ke Qadri silsila mein zikr hai. Hazrat Bahauddin Naqshband farmate hain, 'Ghous-e-Azam ka irshad qalb ko kamal tak le jata hai.' Qadri silsila isay 77 bar baad az-Asr padhne ka mashwara deta hai.",
        "englishDesc": "Murshid al-Kamil signifies the perfect spiritual guide, as noted in Qadri tradition. Bahauddin Naqshband states, 'The guidance of Ghous-e-Azam leads the heart to perfection.' The Qadri order suggests reciting it 77 times daily after Asr.",
        "urduDesc": "مرشد الکامل کا مطلب ہے وہ جو مکمل روحانی رہنمائی کرتا ہے، جیسا کہ قادری سلسلہ میں ذکر ہے۔ حضرت بہاؤالدین نقشبند فرماتے ہیں، 'غوث اعظم کا ارشاد قلب کو کمال تک لے جاتا ہے۔' قادری سلسلہ اسے روزانہ عصر کے بعد 77 بار پڑھنے کا مشورہ دیتا ہے۔"
    },
    {
        "arabic": "صاحب الكرامات",
        "roman": "Sahib al-Karamat",
        "english": "The Possessor of Miracles",
        "urdu": "کرامات کا مالک",
        "romanDesc": "Sahib al-Karamat ka matlab hai wo jo karamat ka malik hai, jaisa ke unke waqiat mein zikr hai. Hazrat Abdul Qadir Jilani 'Sirr al-Asrar' mein farmate hain, 'Karamat Allah ki nishani hai wali ke haath mein.' Qadri silsila isay 66 bar baad az-Maghrib padhne ka mashwara deta hai.",
        "englishDesc": "Sahib al-Karamat signifies the one endowed with miracles, as noted in his accounts. Shaykh Abdul Qadir Jilani in 'Sirr al-Asrar' states, 'Miracles are Allah’s signs through the hands of His saints.' The Qadri order suggests reciting it 66 times daily after Maghrib.",
        "urduDesc": "صاحب الکرامات کا مطلب ہے وہ جو کرامات کا مالک ہے، جیسا کہ ان کے واقعات میں ذکر ہے۔ حضرت عبدالقادر جیلانی 'سر الاسرار' میں فرماتے ہیں، 'کرامات اللہ کی نشانی ہے ولی کے ہاتھ میں۔' قادری سلسلہ اسے روزانہ مغرب کے بعد 66 بار پڑھنے کا مشورہ دیتا ہے۔"
    }
]